In [2]:
import pandas as pd
import numpy as np

C:\Users\Rajaas\anaconda3\lib\site-packages\numpy\_distributor_init.py:30: UserWarning: loaded more than 1 DLL from .libs:
C:\Users\Rajaas\anaconda3\lib\site-packages\numpy\.libs\libopenblas.FB5AE2TYXYH2IJRDKGDGQ3XBKLKTF43H.gfortran-win_amd64.dll
C:\Users\Rajaas\anaconda3\lib\site-packages\numpy\.libs\libopenblas.WCDJNK7YVMPZQ2ME2ZZHJJRJ3JIKNDB7.gfortran-win_amd64.dll
  warnings.warn("loaded more than 1 DLL from .libs:"

In [3]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [4]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [5]:
df1=df['FlightNumber']+10
df1

0    10055.0
1        NaN
2    10075.0
3        NaN
4    10095.0
Name: FlightNumber, dtype: float64

In [6]:
df['FlightNumber'][1]=10055
df

C:\Users\Rajaas\AppData\Local\Temp\ipykernel_14956\2031840077.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['FlightNumber'][1]=10055

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [7]:
df['FlightNumber'][3]=10075
df

C:\Users\Rajaas\AppData\Local\Temp\ipykernel_14956\2306922742.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['FlightNumber'][3]=10075

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [8]:
df['FlightNumber'].astype(int)

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int32

In [9]:
df['From','To']=df['From_To'].str.split('_')

df['From','To']

0        [LoNDon, paris]
1        [MAdrid, miLAN]
2    [londON, StockhOlm]
3      [Budapest, PaRis]
4     [Brussels, londOn]
Name: (From, To), dtype: object

In [10]:
df1=pd.DataFrame([['LoNDon','paris'],['MAdrid','miLAN'],['londON','StockhOlm'],['Budapest','PaRis'],['Brussels','londOn']],columns=['From','To'])
df1

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [11]:
df2=df1['From'].str.capitalize()
df2

0      London
1      Madrid
2      London
3    Budapest
4    Brussels
Name: From, dtype: object

In [12]:
df3=df1['To'].str.capitalize()
df3

0        Paris
1        Milan
2    Stockholm
3        Paris
4       London
Name: To, dtype: object

In [17]:
df4=pd.concat([df2,df3],axis=1)
df4

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [14]:
df=df.drop('From_To',axis=1)
df

   FlightNumber  RecentDelays              Airline           (From, To)
0       10045.0      [23, 47]               KLM(!)      [LoNDon, paris]
1       10055.0            []    <Air France> (12)      [MAdrid, miLAN]
2       10065.0  [24, 43, 87]  (British Airways. )  [londON, StockhOlm]
3       10075.0          [13]       12. Air France    [Budapest, PaRis]
4       10085.0      [67, 32]          "Swiss Air"   [Brussels, londOn]

In [18]:
pd.concat([df4,df],axis=1)

,From,To,FlightNumber,RecentDelays,Airline,"(From, To)"
0,London,Paris,10045.0,"[23, 47]",KLM(!),London
1,Madrid,Milan,10055.0,[],<Air France> (12),Madrid
2,London,Stockholm,10065.0,"[24, 43, 87]",(British Airways. ),London
3,Budapest,Paris,10075.0,[13],12. Air France,Budapest
4,Brussels,London,10085.0,"[67, 32]","""Swiss Air""",Brussels

IndexError: index 5 is out of bounds for axis 0 with size 4